Catalogs/упСхемыОплатыУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упСхемыОплатыУслуг</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УчетОтсрочки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыУчетаОтсрочки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныйКалендарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭтапыОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упВариантыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/упСпособыУчетаОтсрочки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСпособыУчетаОтсрочки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоКалендарнымДням</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоРабочимДням</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упСхемыОплатыУслуг/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

// Процедура ЗаполнитьУчетОтсрочки
// заполняет реквизит УчетОтсрочки значением  "ПоКалендарнымДням"
// у всех ранее не заполненных элементов
// при переходе на версию "3.0.4.10"
Процедура ЗаполнитьУчетОтсрочки() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упСхемыОплатыУслуг.Ссылка
	               |ИЗ
	               |	Справочник.упСхемыОплатыУслуг КАК упСхемыОплатыУслуг
	               |ГДЕ
	               |	упСхемыОплатыУслуг.ПометкаУдаления = ЛОЖЬ
	               |	И упСхемыОплатыУслуг.УчетОтсрочки = ЗНАЧЕНИЕ(Перечисление.упСпособыУчетаОтсрочки.ПустаяСсылка)";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		спрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		спрОбъект.УчетОтсрочки = Перечисления.упСпособыУчетаОтсрочки.ПоКалендарнымДням ;
		спрОбъект.Записать();
	
	КонецЦикла; 	
	

КонецПроцедуры

#КонецОбласти
